name: "wav2vec_py"
backend: "python"
max_batch_size: 16
input [
  {
    name: "waveform"
    data_type: TYPE_FP32 
    dims: [-1]
  }
]

input [
  {
    name: "sample_rate"
    data_type: TYPE_FP32 
    dims: [-1]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 49,768 ]
  }
]

instance_group [
  {
    kind: KIND_CPU
  }
]

dynamic_batching {
  preferred_batch_size: [ 4, 8, 16 ] 
  max_queue_delay_microseconds: 2000
}
